import './css/Notice.css'
import React, {useState} from "react";
import Modal from "./Modal";


const Notice = (props) => {
    const notice = NoticeDummyList();

    const [modalVisibleId, setModalVisibleId] = useState("")

    const onModalHandler = id => {
        setModalVisibleId(id)
    }
    const onCloseHandler = () => {
        setModalVisibleId("")
    }

    function NoticeList(notice) {
        return (notice.map((notice, index) => (

            <tr key={index} className={"detail_" + notice.num}>
                {/*<input type={"hidden"} id="detail" value={JSON.stringify(notice)} />*/}
                <td onClick={() => onModalHandler(notice.num)}>{notice.num}</td>
                <td onClick={() => onModalHandler(notice.num)}>{notice.title}</td>
                <td onClick={() => onModalHandler(notice.num)} style={{textAlign: 'center'}}>{notice.count}</td>
                <td onClick={() => onModalHandler(notice.num)}>{notice.date}</td>

                <Modal id={notice.num}
                       modalVisibleId={modalVisibleId}
                       setModalVisibleId={onCloseHandler}

                       header={notice.title}
                       contents={notice.contents}
                       date={notice.date}
                       count={notice.count}
                />
            </tr>
        )))
    }

    return (
        <section className={"content"}>
            {/*header*/}
            <div className="notice_header_wrap header_wrap">
                <div className="notice_header _header">
                    <div className="notice_header_title"><h2>Notice</h2></div>
                    <div className="notice_header_sub _header_sub">
                        <p>This page exists for notice.</p>
                        <div className="notice_header_searchBar _searchBar">
                            <select className="notice_header_searchBar_select">
                                <option value="0">Title</option>
                                <option value="1">Content</option>
                                <option value="2">Title+Content</option>
                            </select>
                            <input className="notice_header_searchBar_input" type={"text"} placeholder={"Search"}/>
                            <input className="notice_header_searchBar_btn" type={"button"} value="▼"/>
                        </div>
                    </div>
                </div>
            </div>
            {/*body*/}
            <div className={"notice_body_warp"}>
                <table className="notice_table">
                    <colgroup>
                        <col style={{width: '5%'}}/>
                        <col style={{width: '80%'}}/>
                        <col style={{width: '8%'}}/>
                        <col style={{width: '7%'}}/>
                    </colgroup>
                    <thead className={"notice_table_head"}>
                    <tr>
                        <th>No.</th>
                        <th>Title</th>
                        <th style={{textAlign: 'center'}}>count</th>
                        <th>Date</th>
                    </tr>
                    </thead>
                    <tbody className={"notice_table_body table_body"}>
                    {NoticeList(notice)}
                    </tbody>
                </table>
            </div>
            <div className="page">◀ 1/1 ▶</div>
        </section>
    )
}

export default Notice;


const NoticeDummyList = () => {
    let NoticeList = new Array();
    NoticeList[0] = {
        num: 5,
        title: "MJ's coin",
        contents: "상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다상세내용입니다용",
        date: '2023.03.23',
        count: 23
    }
    NoticeList[1] = {
        num: 4,
        title: "Show the Coin List for free",
        contents: "Show the Coin List for free",
        date: '2023.01.20',
        count: 31
    }
    NoticeList[2] = {
        num: 3,
        title: "kisan's coin",
        contents: "Show the Coin List for free",
        date: '2023.01.15',
        count: 35
    }
    NoticeList[3] = {
        num: 2,
        title: "how to vote",
        contents: "Show the Coin List for free",
        date: '2023.01.11',
        count: 33
    }
    NoticeList[4] = {
        num: 1,
        title: "Show the Coin List for free",
        contents: "Show the Coin List for free",
        date: '2022.11.23',
        count: 32
    }
    // console.log(NoticeList);
    return NoticeList
}



